# GetLabelName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GlobalParameter..::..GetLabelName Method
GlobalParameter Class See Also
---
Returns the name of this parameter's label, which is used to label dimension elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public string GetLabelName()
```

Visual Basic
---
```text
Public Function GetLabelName As String
```

Visual C++
---
```text
public:
String^ GetLabelName()
```

# ### Return Value
The name of the parameter's label.
# Remarks
Note that a Label equals a parameter's name if the parameters is non-reporting. Reporting parameters, however, have their labels suffixed by a special string to make it obvious the parameters is reporting (thus suitable to be driven by a dimension.)
# See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace